---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.RemoveField(System.Int32)
source: html/7a82bf19-366f-cabd-fe1c-81979a2d084c.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.RemoveField Method

Removes a field.

## Syntax (C#)
```csharp
public void RemoveField(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index of the field to remove.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - index is not a valid field index in this ScheduleDefinition.